Revit 2024 API
NurbsSurfaceData.IsValid Method
 Check if the object contains a valid NurbsSurfaceData.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsValid()
Visual Basic
Public Function IsValid As Boolean
Visual C++
public:
bool IsValid()
Return Value
 True if it is a valid NurbsSurfaceData, false otherwise.
See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace